{"meta":{"title":"思维的持续","subtitle":"你好，世界。","description":null,"author":"EdwardHubs","url":"https://edwardhubs.github.io","root":"/"},"pages":[{"title":"关于","date":"2020-09-08T09:50:50.000Z","updated":"2020-09-12T03:07:33.081Z","comments":false,"path":"about/index.html","permalink":"https://edwardhubs.github.io/about/index.html","excerpt":"","text":"个人简介：思维的持续，一个真的有思想，不穿格子衬衫的程序员。用眼睛观察世界，用耳朵聆听故事，用文字书写感悟，在内心细细的品味，试图领略生命的美好。个人微信：edwardhubs个人邮箱：&#x65;&#x64;&#119;&#x61;&#114;&#x64;&#104;&#x75;&#98;&#x73;&#64;&#x73;&#105;&#x6e;&#97;&#x2e;&#99;&#x6f;&#x6d;"},{"title":"categories","date":"2020-09-08T09:42:58.000Z","updated":"2020-09-08T09:43:39.366Z","comments":false,"path":"categories/index.html","permalink":"https://edwardhubs.github.io/categories/index.html","excerpt":"","text":""},{"title":"标签","date":"2020-09-08T09:39:51.000Z","updated":"2020-09-09T06:35:50.552Z","comments":false,"path":"tags/index.html","permalink":"https://edwardhubs.github.io/tags/index.html","excerpt":"","text":"随笔 心情"},{"title":"欢迎留言，乐于分享。","date":"2020-09-09T02:08:57.000Z","updated":"2020-09-09T06:36:29.295Z","comments":true,"path":"guestbook/index.html","permalink":"https://edwardhubs.github.io/guestbook/index.html","excerpt":"","text":""}],"posts":[{"title":"雨中，那一道人性闪亮的光辉","slug":"shining-light","date":"2020-09-14T07:50:16.000Z","updated":"2020-09-14T08:03:46.747Z","comments":true,"path":"2020/09/14/shining-light/","link":"","permalink":"https://edwardhubs.github.io/2020/09/14/shining-light/","excerpt":"","text":"01从昨晚开始下起了大雨，早上起来，雨已经停了。 早上去公司上班，下地铁走在去往公司的路上，天空又下起了大雨，人们猝不及防的撑起了雨伞。上班的人群，快节奏的迈着步伐，对于9点上班的人来说，此时已经快要迟到了，雨天似乎也是更容易交通堵塞。前面是一条马路，正好遇上了红灯，心里再着急，大家不得不停下脚步等着信号灯变绿。人群中，有一个人顶着大雨，站在那里显得格外突兀，雨水从她脸颊滴落，衣服已经被大雨快速打湿。旁边的人都是自顾自的站在那里，没有人在意旁边这个被雨水淋湿赶着上班的人。 我远远的看着四周没有动静，打算过去为这个同行的陌生人撑伞，哪怕只是一个红路灯的距离。在对人性失望的那一刻，人群中另外一个身影，挤开了拥挤的人群，来到了这个同行的陌生人旁边，为他挡下了这如注的雨水。此时，路面的绿灯亮起，人群又开始快速的移动起来，各自走向不同的办公大楼。 雨中，那一道人性闪亮的光辉，瞬间照亮了灰蒙蒙的天空。 02事后，这件事也让我产生了一个新的想法。如果刚刚那个没带雨伞被淋湿的人是我，我会怎么做？是选择主动找一个旁边的人帮助，询问对方是否介意为我撑伞，还是选择一个人顶着大雨前行？如果不出意料，我应该也是选择后者，可能，大多数人也是选择后者，为什么会选择这样？ 从人性的角度分析，可以从两方面看这个问题：第一，大多数人都不愿意找陌生人帮忙，有很大的顾虑觉得打扰他人会不礼貌的行为。找人帮忙，哪怕是一件小事，自己主动去寻求帮助，如果对方拒绝，自己也会很尴尬。为了避免这种社交上的不愉快感，而选择不向他人寻求帮助。 第二，根据自己当下的情况，尝试向周围的人寻求帮助，哪怕遭到拒绝或是没有人回应，依然选择试一试，其实并没有什么实际的损失。 这种情况，我遇到过很多次，我无一例外的都是选择第一种方式应对，但是这次开始才让我考虑自己之前的行为是否存在不妥。担心给他人造成麻烦，害怕拒绝，不愿意主动与陌生人社交，所以一直选择保守的封闭自己。静下心仔细想想，很多事情并不是自己想象中的那样，尝试着迈出一步，并不会失去什么，或许会让自己活得更加自信。 03人，总是在不断的成长和变化，因为经历的人和事，也随之改变自己的行为方式。接触到不同的人，不同的事，让自己从中学会看到自己的样子，照亮现实的问题。 一直固守在原封不动的思维圆圈，实际的行为也会一如从前，永远走不出自己设定的范围，就像被自己画地为牢圈在了一个固定的地方。 人要保持开放一种的心态，主动才会有故事，才会更容易看到人性中闪亮的光辉。","categories":[{"name":"情感","slug":"情感","permalink":"https://edwardhubs.github.io/categories/%E6%83%85%E6%84%9F/"}],"tags":[{"name":"随笔","slug":"随笔","permalink":"https://edwardhubs.github.io/tags/%E9%9A%8F%E7%AC%94/"}]},{"title":"观《勇敢的心》有感","slug":"brave-heart","date":"2020-09-09T06:39:12.000Z","updated":"2020-09-12T04:13:55.092Z","comments":true,"path":"2020/09/09/brave-heart/","link":"","permalink":"https://edwardhubs.github.io/2020/09/09/brave-heart/","excerpt":"","text":"这天，天气晴朗，无云万里。 小丑们，表演着看似滑稽的刑罚。 所有的民众，神父、贵族、妇人、朋友、暴政统治者。 有欢呼的、心碎的、看戏的和守卫者。 又迎来一个历史酿成的悲凉人物。 只为了，获得可怜的服从。 当所有的人忘却了身份， 都在高呼“宽恕”的时候。 他却歇斯底里的喊出了“自由”！ 这一声呐喊，唤醒了整个沉睡的民族！ 随着手中信物脱离指尖的瞬间， 这一刻，自由，他做到了。 他的父亲、兄弟、妻子、以及为了自由而战的苏格兰人民， 为了灵魂的自由、为了民族的高度。 也许，人类文明的进步注定了会有牺牲。 不管是平民、贵族、哲学家、还是领袖， 在历史面前，所有的人都显得那么无能为力。 历史不会去理会，这里发生了什么， 它的车轮依然无情的从这里碾压过去。 人们前赴后继的接过历史的接力棒。 接着，寻找民族未来的出路。","categories":[{"name":"情感","slug":"情感","permalink":"https://edwardhubs.github.io/categories/%E6%83%85%E6%84%9F/"}],"tags":[{"name":"心情","slug":"心情","permalink":"https://edwardhubs.github.io/tags/%E5%BF%83%E6%83%85/"}]},{"title":"在雨中狂奔","slug":"rain-run","date":"2020-09-08T06:34:33.000Z","updated":"2020-09-12T03:27:05.067Z","comments":true,"path":"2020/09/08/rain-run/","link":"","permalink":"https://edwardhubs.github.io/2020/09/08/rain-run/","excerpt":"","text":"今天又是雨天，不，应该说这周都是雨天，这个月都是雨天。雨天，很神奇，它把我的时间拉回到了多年以前的一个狂风暴雨的傍晚。一直不喜欢雨天，就像不喜欢冬天一样，但那次雨天例外。 这是炎热的让人厌烦的一天，整个空气像是在发怒，分明能感觉到热气从裤脚下灌进来，热又湿。下午在学校上完课，吃完晚饭，晚上没有课，就跟一个朋友商量好，夜游附近的公园。大概15分钟的路程，来到公园之后，围着湖边散步。湖边迎面杨柳依依，微风和煦，瞬间扫除了闷热，心中甚是欢喜。这样的惬意持续了不到一个小时，白天积压的闷热天气，疯狂的开始发泄。没有一点预备，也没有一点防备，倾盆大雨像是有人往头上倒水一般来得突然，身上的衣服已经湿透。我跟朋友两个人四目相对，尴尬无以言表，只能苦笑。我正举目四处寻找避雨的场所，朋友诡秘的说，要不要试试在这样的雨中狂奔？疯了，停顿了一秒，我的肾上腺素立马飙升，有何不可？人生难得几回狂，此时不狂何时狂？俗话说得好，常在河边走，哪有不湿鞋，既然湿了鞋，干脆洗个澡！我抱着无所畏惧的心态，在这样侵略式的大雨中，肆无忌惮的享受暴雨的洗礼。豆大的雨滴，就好像在洗澡的时候，把洗浴喷头水压调到最大，狠狠的冲刷着打在身上。大雨似乎也看出来了我们的想法，默契的配合我们，没有半点减弱的迹象。雨水顺着脖颈留下，穿过身体，从裤脚而出，再灌进鞋底，身体和鞋都越来越重。我们一边跑，一边看着平常熟悉的街道，房子，路灯，在大雨的洗礼下，显得格外的干净。同样的一段路，以不同的方式经过，奇妙的呈现出了不一样的画面，这种感觉很微妙。而我们两个，就好像青春期的少年，为了引起他人的注意，想通过特立独行的行为方式，以满足自己被关注的需求。 我想，现在的我们应该都不会再去尝试这样的无厘头的行为了。人被关注的需求，不会随着年龄的变化而消失，只是寻找的出口变得更加多元和柔和了许多。","categories":[{"name":"情感","slug":"情感","permalink":"https://edwardhubs.github.io/categories/%E6%83%85%E6%84%9F/"}],"tags":[{"name":"随笔","slug":"随笔","permalink":"https://edwardhubs.github.io/tags/%E9%9A%8F%E7%AC%94/"}]},{"title":"一个技术人的博客情怀","slug":"blog-feelings","date":"2020-09-08T03:15:01.000Z","updated":"2020-09-12T04:08:30.038Z","comments":true,"path":"2020/09/08/blog-feelings/","link":"","permalink":"https://edwardhubs.github.io/2020/09/08/blog-feelings/","excerpt":"","text":"01新浪，搜狐，雅虎，曾经的门户巨头，博客板块都是他们的核心业务，在整个互联网的世界具有举足轻重的地位。如今的博客，它像是上个世纪的产物，流行于10几年前，如今却几乎不见踪影。博客，它是时代的产物，也必然有其自身的历史使命。 互联网的世界，日新月异，在新的技术浪潮的冲击下，没有人能够抵抗它给你的生活带来的变化。博客，曾经为互联网的发展贡献了自己不可忽视的力量，现在潮水退去被搁浅在了沙滩上。博客，其实只是一种形态，本质上它就是内容的创造和呈现，这一点放到现在也是依然不过时的存在。 博客的形态几乎已经不存在了，如今它演变成了一个个自媒体的公众号和视频号，本质都是生产内容。 02很早之前，就想搭建一套自己的博客，那时候是觉得很酷，拥有一个自己说了算的发布平台。随着后来陆续各个内容发布平台的诞生，自建博客网站似乎已经变得毫无必要性，所以我也就放弃了这个想法。 “拿来主义”，可以直接上手用，不用再耗费精力去摸索了。这也验证那一句话：有些事情，当时不去做，可能以后就再也不会去做了，不是因为不能去做，而是可能已经失去了意义。就在前几天又心血来潮，又想要掰扯弄一个博客，我想可能是因为情怀吧！ 有些事情，放在你的心里，没有去完成。但是它总是会在某个时刻，猝不及防的提醒你，哪怕已经变得不再重要，那个召唤的声音却依然初心未改。就这样，就把曾经丢掉在风中的事情，又重新捡起来开始做起来。最近三天陆陆续续，每天花2个小时研究，搭建，基本已经搭建完成，发布了几篇旧文，排版还有点丑陋，需要后续花时间再调整了。 博客链接 https://edwardhubs.github.io/ 现在网上的资料丰富，搭建过程还是比较顺利，虽然不复杂也拖了这么久才着手来做，内心有点自责。博客搭建起来，敲下访问链接，打开首页的时候，总算是给了自己一个安慰。因为欠着的感觉真的不好，欠着别人，你会感觉不好意思，欠着自己，却不会感觉欠了自己的。 搭建一个属于自己的博客，最主要的除了情怀，还有一个显而易见的好处，当然就是你想写什么写什么（当然不要涉及不和谐的内容），不会像在其他平台上写作，容易被封杀，恶意举报之类的问题。这里是由你自己创造的空间，这里的一切基本不受约束，这里是由你说的算，这里没有平台规则，可以最大限度的表达情感，书写文字。 我想，这种宽大的自由度，也是每一个想要搭建自己博客平台的美好夙愿。凡是有利，有弊。依托于平台的各种内容发布平台，微信公众，今日头条，简书等等都会有自己的算法和推荐引流的机制，让优质的内容可以短时间传播扩散。 在如今各大自媒体平台四处横生的环境下，自己的私人博客，是另外的一种小众的存在。它几乎没有什么会被推荐的流量导入，想要获得巨大的阅读量几乎是不可能，只有那些忠实的读者才会主动检索，收藏你的文章。因为情怀，才想要搭建自己的博客，它的存在对于我来说就是一种安静的力量。因为它是我表达形式的另外一种存在，只对于我个人而言特殊，仅此也就足以。 03一个作者，留下的是一本本写过的书；一个画家，留下的是一幅幅画作；一个建筑师，留下的是一幢幢建筑。每一个手艺人，都靠着自己的双手创造着这个世界上无数美好的事物，有的流芳百世，有的昙花一现。身为互联网从业者，在信息时代，创造的事物早已经不是那些实体的物件，看得见摸不着，这是互联网工程师创造事物的特征。互联网技术从业者，想要留下什么，先从一个自己的博客网站开始吧，这或许是最低的起点，也是最属于个人最纯粹，最真实的，可预见的东西。","categories":[{"name":"情感","slug":"情感","permalink":"https://edwardhubs.github.io/categories/%E6%83%85%E6%84%9F/"}],"tags":[{"name":"随笔","slug":"随笔","permalink":"https://edwardhubs.github.io/tags/%E9%9A%8F%E7%AC%94/"}]},{"title":"当我在跑步的时候，我在想些什么？","slug":"run-think","date":"2020-09-07T03:49:09.000Z","updated":"2020-09-12T03:27:11.327Z","comments":true,"path":"2020/09/07/run-think/","link":"","permalink":"https://edwardhubs.github.io/2020/09/07/run-think/","excerpt":"","text":"跑步，是现代人一种朴素的运动方式，也是人类从原始时代保留至今的能力。如果你问我，有什么事情，是我坚持十年都还在做的事情，我想就是跑步。 01 把跑步当作一项任务我曾经是一名体育特长生，感谢这两年的时间，让我养成了长期的运动习惯。从体育成绩来说，毫无疑问我是非常合格的，也成了我自由散漫的借口；从思想层面来说，我无论如何都不能承认自己是一名合格的体育生。师长们是抱着望我成材的美好愿望，我是抱着浑水摸鱼的天真想法，两种思想这样奇妙的组合在一起。师长们把体育成绩作为加分的一个通道，而在当时的我看来，这只是我躲避学校功课的一种方式。在体队每天的跑步训练，对于我来说只是一项任务。把一件事当作任务看待，好处是能逼迫你马上行动，先干起来。这就像给一项任务限定截止日期一样，你记着有这个事儿，一定要去做，短期来看这是一个好的开始。长期来看，如果还是把这件事情当作任务来驱动你的行动，就会有一种强烈的压迫感，导致后劲不足无法持续。当时的我，抱着这样的一种心不在焉的态度，对跑步也没有期许，也谈不上爱好，到最后甚至是变成了痛苦。 02 把跑步当作一种减压工具忘了从什么时候开始，跑步变成了我减压的工具，或许这也是我唯一的，坏情绪的出口。遇到心情压抑烦闷的时候，我选择穿上跑鞋，通过长时间的跑步，获得分泌的多巴胺让自己变得积极。工作的压力，生活的烦恼，在跑步的过程中，不知不觉大脑被放空，不好的情绪都被汗水抹去，而脚下却更有力量。跑步让我感觉自己被抽离了那个情绪不好的环境，把自己变成了一个置身事外的人，情绪得到释放。回过头再来看，竟然会以一种全新的感觉来面对，我想它一定是带给了我安慰。 03 把跑步当作一种兴趣跑步是很累的一件事而且非常的枯燥，我万万没有想到它会变成我的兴趣。兴趣最大的好处就是让你能够主动的，下意识的，无需刻意的去做。看到一条干净笔直，没有车辆适合跑步的马路，就能够随时随地跑起来。雨后跑步，你会体验到人的心被洗涤的明亮，你的每一步都是心灵上的满足。雪后跑步，你会体验到人在画中移动的美妙，你的每一步都是画作上的一笔。如果你问我，给我一个小时的娱乐时间，我会去干什么，我想应该是跑步。","categories":[{"name":"情感","slug":"情感","permalink":"https://edwardhubs.github.io/categories/%E6%83%85%E6%84%9F/"}],"tags":[{"name":"随笔","slug":"随笔","permalink":"https://edwardhubs.github.io/tags/%E9%9A%8F%E7%AC%94/"}]},{"title":"慵懒的季节","slug":"lazy-season","date":"2020-09-07T02:33:05.000Z","updated":"2020-09-12T04:08:51.109Z","comments":true,"path":"2020/09/07/lazy-season/","link":"","permalink":"https://edwardhubs.github.io/2020/09/07/lazy-season/","excerpt":"","text":"01据说，冬季是懒人的季节，足不出户，全副武装蜷缩在厚厚的大衣里面，只为躲避那让人拒绝的寒风。冬季是冷静的，我不喜欢冬季的冷，但喜欢冬季的静，这种冷让我无所适从，这种静让我倍感清醒。冬季的节律夜长日短，似乎是在有意限制人们的活动时间，唯有冬日里的一缕阳光，才能驱散这个季节的慵懒。 02我站在马路旁护沿树的底下，放眼尽是简单又不失享受的格调。不自觉的伸手轻抚图案般自然的树干，抬头就能看见稀落的树叶，在撑大的树叶下，看到的是掩饰不了缝隙。人行道路面四方的小瓷石，无论怎么安放都不会觉得有什么不妥。你急促或者闲庭信步似的从这里经过，会不会带给你，当时只道是寻常般的邂逅。 微风，我们欲享受，雷雨，我们欲避之；微晴之后，微笑，微凉的日子，脖颈间的衣领围脖，卸下领子，吹散本已被蜷缩的身心。冬日的阳光，无需仰视既可明媚。我朝着阳光的方向一路跟随，有光的前方是我要去的地方，路过的脚下是一个完全属于自己的空间。在这里留给别人的是你的背影，追逐的却是别人的背影，踩着别人的走过的路，留下自己走过的路，让别人来走你现在已经走过，还有即将要走的路。 人们经过的每一个地方，春夏秋冬蕴含着数不完的记忆和分不清的是过去还是未来的将要。我曾经以为生活需要在原地等待，等待想要的出现，到后来才想明白原来生活的等待就是藏在行动中的。我已经准备好，一小段时间，一小时，半小时，也能把它当作一种旅行。北风烈的瑟瑟刺骨，带给我们一种制造躲避，懒惰的理由了。冬季再冷，也有温暖的时候，一定会有阳光普照的日子，需要的是信念。 03影响人的是环境和心态，是因为我们是有生命律动，有温度的适应者。有些东西，不能改变，想选择忘却，这恰恰有违背心意初衷。当我们不经意进入到另一种自我的状态中的时候，我们却能够轻易的忽略掉，那些看事无法重构的事物。","categories":[{"name":"情感","slug":"情感","permalink":"https://edwardhubs.github.io/categories/%E6%83%85%E6%84%9F/"}],"tags":[{"name":"随笔","slug":"随笔","permalink":"https://edwardhubs.github.io/tags/%E9%9A%8F%E7%AC%94/"}]},{"title":"故事","slug":"story","date":"2020-09-07T02:30:05.000Z","updated":"2020-09-12T03:27:16.906Z","comments":true,"path":"2020/09/07/story/","link":"","permalink":"https://edwardhubs.github.io/2020/09/07/story/","excerpt":"","text":"来到这个世界，随着时间的推移慢慢成长，每个人经历不同的人生故事。 你可以通过阅人，了解身边的人和你关注的人他们的故事。 你可以通过阅读，了解那些离你遥远的陌生人的故事。 每个人有自己的生活，有自己故事，是生命赋予的权利。 一个陌生人，在一个和你完全不相交的两条平行线时按照自己的轨迹行走，你不会知道他的故事。 大千世界，无数的陌生人与自己同在，此刻的你可能在忙于生计，而他可能在悠闲度日。 一个人，是一本书，一个故事集，更是一个世界。 你经历的那些，怀念的，后悔的，快乐的，痛苦的，一个个平凡的故事勾勒了你人生的版图。 人们爱听故事，也爱讲故事，故事中夹杂着一个个鲜活的人与情感的交集。 陌生人的故事，有的会引发你的共鸣，有的会引发你的思考，有的拓宽了你的眼界，他们不是你的故事，却让你多维的看到了这个世界的一隅。 抬头仰望星空，凝视着那些一闪一闪的星星，不同星球那里会有什么故事，因为好奇，所以不顾一切想要探索究竟。这个世界，小到每一个人，大到宇宙，都只不过是世界的一个组成部分，他们共生共存，不分彼此。 有交集才会有故事，只有一个人的故事，那是孤寂的，就像是银河系中不同星系远隔光年。 我们听着一个个故事长大，传承者，创造者，也是毁灭者，就这样循环往复。 人是故事的载体，你愿或不愿，你都身处其中，每个鲜活的个体都在忙着应对自己的五味杂陈。 你在做什么，看到了什么，听到了什么，对你来说这就是最真实的世界，对他人而言这些是不存在的，这些只属于你。 生活，大部分时间是一成不变的，有时候的说变就变，那将是你生命中所要承受的故事。 那些当时只道是寻常的故事，回过头看往昔，却成了最不能割舍的。 我们都是自己故事的主角，这个小小的世界里，因为遇事，遇人有了丰富的想象，折射了光辉，覆盖了灰暗。 我们活跃着，追寻着，那些生命中的美好事物，那些离我们看似遥远的东西，它是我们前进的动力。 有过激情澎湃，有过意志消沉，有过豪言壮语，有过臣服现实，这是你的故事。 不做一个孤独的奋斗者，听听别人的故事，也听听自己的故事。","categories":[{"name":"情感","slug":"情感","permalink":"https://edwardhubs.github.io/categories/%E6%83%85%E6%84%9F/"}],"tags":[{"name":"随笔","slug":"随笔","permalink":"https://edwardhubs.github.io/tags/%E9%9A%8F%E7%AC%94/"}]}],"categories":[{"name":"情感","slug":"情感","permalink":"https://edwardhubs.github.io/categories/%E6%83%85%E6%84%9F/"}],"tags":[{"name":"随笔","slug":"随笔","permalink":"https://edwardhubs.github.io/tags/%E9%9A%8F%E7%AC%94/"},{"name":"心情","slug":"心情","permalink":"https://edwardhubs.github.io/tags/%E5%BF%83%E6%83%85/"}]}